# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке,
# причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод –
# на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из
# управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь
# непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход
# собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint
n = int(input("Введите количество кустов: "))
list_a = [randint(1, 19) for i in range(n)]
print(*list_a)

max_1 = 0
for i in range(len(list_a)):
    sum_1 = list_a[i] + list_a[i - 1] + list_a[i - 2]
    if sum_1 > max_1:
       max_1 = sum_1
print('Максимальное число ягод', max_1)