#
# Дополнительно1
# Стоимость строки
#
# Дана строка текста. Напишите программу для подсчета стоимости строки, исходя из того, что один любой символ (в том числе пробел) стоит
# 60
# 60 копеек. Ответ дайте в рублях и копейках в соответствии с примерами.
#
# Формат входных данных
# На вход программе подается строка текста.
#
# Формат выходных данных
# Программа должна вывести стоимость строки.
#
# Тестовые данные
# Sample Input 1:
# Привет, как дела?!
# Sample Output 1:
# 10 р. 80 коп.
# Sample Input 2:
# Тимур - лучший математик на свете!!
# Sample Output 2:
# 21 р. 0 коп.
#
#
# Дополнительно2
# Количество слов
#
# Дана строка, состоящая из слов, разделенных пробелами. Напишите программу, которая подсчитывает количество слов в этой строке.
#
# Формат входных данных
# На вход программе подается строка.
#
# Формат выходных данных
# Программа должна вывести количество слов в строке.
#
# Примечание 1. Кроме слов в тексте могут присутствовать только пробелы (один или несколько).
#
# Примечание 2. Решите задачу в одну строчку кода.
#
# Тестовые данные
# Sample Input 1:
# Hello world
# Sample Output 1:
# 2
# Sample Input 2:
# Timur forever young
# Sample Output 2:
# 3
#
#
# Дополнительно3
# Напишите
# программу, которая
# будет
# преобразовывать
# десятичное
# число
# в
# двоичное.
#
# *Пример: *
#
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10