# Задача.
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
#
# 45 -> 101101
# 3 -> 11
# 2 -> 10
# ------------------------------------------------------

decimal = int(input("Введите число: "))
result = ""
while decimal > 0:
    result += str(decimal % 2)
    decimal //= 2
print(result)